package OOP.Lesson6.Work;
public class Work00_31 {
    public static void main(String[] args) {
        Work00 result = new Work00();
        String res = result.countInNum(10, - 10, 10);
        System.out.println(res);
    }

    // Задача 42: Напишите программу, которая будет преобразовывать
    // десятичное число в двоичное.
    // 46 -> 101110
    // 13 -> 1101
    // 2 -> 10


}
